w = int(input("請輸入加總的用電值(W/瓦): "))
hr = int(input("輸入每日用電時數: "))
so = str(input("是否需要計算價格 (Y) :"))
w = (w*hr)/1000
print ("度數:",w,"每個月使用度數:",w*30)
w = w*30*2
def number(w):
    if w > 330:
        if w > 500:
            if w > 700:
                if w > 1000:
                    if w > 1001:
                        w = (w-1000)*7.69+(w-700)*5.83+(w-500)*4.8+(w-330)*3.52+(w-120)*2.38+120*1.63
                        print("您的電費為每個月",w,"元(新台幣)")
                    else:
                        print("error")
                else:
                    w = (w-700)*5.83+(w-500)*4.8+(w-330)*3.52+(w-120)*2.38+120*1.63
                    print("您的電費為每個月",w,"元(新台幣)")
            else:
                w = (w-500)*4.8+(w-330)*3.52+(w-120)*2.38+120*1.63
                print("您的電費為每個月",w,"元(新台幣)")
        else:
            w = (w-330)*3.52+(w-120)*2.38+120*1.63
            print("您的電費為每個月",w,"元(新台幣)")
    else:
        w = (w-120)*2.38+120*1.63
        print("您的電費為每個月",w,"元(新台幣)")
if so == "N" or so == "n" :
    print
elif so == "Y" or so == "y" :
    number(w)
else:
    number(w)
